Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult
Possible results from setting the mapping from Family symbols to Fabrication part types.
Since:
2022

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.UnsupportedFabricationPartType
Failed due to attempting to convert an unsupported Fabrication part type. It is expected to be either valve, strainer, damper, smoke detector, end cap, or other in line component.

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.UnsupportedFamilySymbol
Failed due to attempting to convert an unsupported Family symbol. It is expected to be either valve, strainer, damper, smoke detector, end cap, or other in line component.

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.InvalidFabricationPartType
Failed because there was an invalid Fabrication part type identifier or an identifier that did not exist in the mappings.

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.InvalidFamilySymbol
Failed because there was an invalid Family symbol identifier or an identifier that did not exist in the mappings.

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.Undefined
Failed because the map contained no entries.

Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult.Success
Setting the mappings for conversion was successful.